load-test.yml
config:
  target: "https://redleaf-bd-backend.vercel.app"
  http:
    timeout: 10
  phases:
    # Warmup: 1,000 users over 60 seconds
    - name: "Warmup - 1000 users"
      duration: 60
      arrivalRate: 16
      rampTo: 16

    # Ramp to 5,000 users over 120 seconds
    - name: "Load - 5000 users"
      duration: 120
      arrivalRate: 40
      rampTo: 80

    # Peak: 10,000 concurrent users for 60 seconds
    - name: "Peak - 10000 users"
      duration: 60
      arrivalRate: 160

  plugins:
    expect: {}

scenarios:
  # Public Product Browsing (most common path)
  - name: "Browse Products"
    weight: 60
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
      - get:
          url: "/products?page=1&limit=20"
          expect:
            - statusCode: 200
      - get:
          url: "/products?category=Skincare&page=1&limit=20"
          expect:
            - statusCode: 200
      - get:
          url: "/settings/delivery"
          expect:
            - statusCode: 200

  # Product search
  - name: "Search Products"
    weight: 25
    flow:
      - get:
          url: "/products?search=cream&page=1&limit=10"
          expect:
            - statusCode: 200
      - get:
          url: "/products?sort=price_asc&page=1&limit=20"
          expect:
            - statusCode: 200

  # Blog reads
  - name: "Read Blogs"
    weight: 15
    flow:
      - get:
          url: "/blogs"
          expect:
            - statusCode: 200